Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/CommonModules/AzRyDEV/Module.bsl
Функция ПолучитьСуммуВУчетнойВВалюте(ВалютаОпераций, Период, Сумма, ДокументСсылка = Неопределено, Курс = Неопределено, Кратность = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс,
	               |	КурсыВалютСрезПоследних.Кратность
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	               |ГДЕ
	               |	КурсыВалютСрезПоследних.Валюта = &ВалютаУчета";
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("Период", Период);
	Резултат = Запрос.Выполнить();
	Выборка = Резултат.Выбрать();
	КурсУчета = 0;
	КратностьУчета = 0;
	Если Выборка.Следующий() Тогда
		КурсУчета = Выборка.Курс;
		КратностьУчета = Выборка.Кратность;
	КонецЕсли;

	Если ДокументСсылка = Неопределено Тогда
		Если Курс = Неопределено И Кратность = Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КурсыВалютСрезПоследних.Курс,
			|	КурсыВалютСрезПоследних.Кратность
			|ИЗ
			|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
			|ГДЕ
			|	КурсыВалютСрезПоследних.Валюта = &ВалютаОп";
			Запрос.УстановитьПараметр("ВалютаОп", ВалютаОпераций);
			Запрос.УстановитьПараметр("Период", Период);
			Резултат = Запрос.Выполнить();
			Выборка = Резултат.Выбрать();
			КурсНац = 1;
			КратностьНац = 1;
			Если Выборка.Следующий() Тогда
				КурсО      = Выборка.Курс;
				КратностьО = Выборка.Кратность;
			КонецЕсли;
		Иначе 	
			КурсО      = Курс;
			КратностьО = Кратность;			
		КонецЕсли; 
	Иначе		
		Если Курс = Неопределено И Кратность = Неопределено Тогда
			КурсО      = ДокументСсылка.Курс;
			КратностьО = ДокументСсылка.Кратность;	
		Иначе 	
			КурсО      = Курс;
			КратностьО = Кратность;			
		КонецЕсли;
	КонецЕсли;

	Возврат Сумма * КурсО / КратностьО * КратностьУчета / КурсУчета;
КонецФункции
